In [3]:
from pandas import DataFrame,Series
import numpy as np
data_frame = DataFrame(np.arange(36).reshape((6,6)),columns= list('abcdef'))

data_frame

    a   b   c   d   e   f
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [4]:
data_frame['key'] = Series(list('aaabbb'),name = 'key')
data_frame

    a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a
3  18  19  20  21  22  23   b
4  24  25  26  27  28  29   b
5  30  31  32  33  34  35   b

In [6]:
data_group = data_frame.groupby('key')
dict([x for x in data_group])['a']

    a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a

In [7]:
data_group = data_frame.groupby('key')
dict([x for x in data_group])['b']

    a   b   c   d   e   f key
3  18  19  20  21  22  23   b
4  24  25  26  27  28  29   b
5  30  31  32  33  34  35   b

In [9]:
dic_a = dict([x for x in data_group])['a']
dic_a

    a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a

In [10]:
a = [x for x in data_group]
a

[('a',
      a   b   c   d   e   f key
  0   0   1   2   3   4   5   a
  1   6   7   8   9  10  11   a
  2  12  13  14  15  16  17   a),
 ('b',
      a   b   c   d   e   f key
  3  18  19  20  21  22  23   b
  4  24  25  26  27  28  29   b
  5  30  31  32  33  34  35   b)]

In [11]:
type(a)

list

In [12]:
data_group

In [14]:
for k,v in data_group:
    print(k,v)

a     a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a
b     a   b   c   d   e   f key
3  18  19  20  21  22  23   b
4  24  25  26  27  28  29   b
5  30  31  32  33  34  35   b